amcelroy/ra-pac/svd_patch/R7FA4M3AF.svd
<?xml version='1.0' encoding='utf-8'?>
<device xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.3" xsi:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
    <vendor>Renesas Electronics Corporation</vendor>
    <vendorID>Renesas</vendorID>
    <name>R7FA4M3AF</name>
    <series>RA4</series>
    <version>1.40.00</version>
    <description>Arm Cortex,M33 based Microcontroller RA4M3 group</description>
    <licenseText>This software is supplied by Renesas Electronics Corporation and is only intended for \n
use with Renesas products. No other uses are authorized. This software is owned by \n
Renesas Electronics Corporation and is protected under all applicable laws, including \n
copyright laws. \n
\n
THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING \n
THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO \n
WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. \n
ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM EXTENT PERMITTED NOT \n
PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED \n
COMPANIES SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL \n
DAMAGES FOR ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE \n
BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. \n
\n
Renesas reserves the right, without notice, to make changes to this software and to \n
discontinue the availability of this software. By using this software, you agree to \n
the additional terms and conditions found by accessing the following link: \n
http://www.renesas.com/disclaimer \n
\n</licenseText>
    <cpu>
        <name>CM33</name>
        <revision>r0p4</revision>
        <endian>little</endian>
        <mpuPresent>true</mpuPresent>
        <fpuPresent>true</fpuPresent>
        <vtorPresent>true</vtorPresent>
        <nvicPrioBits>4</nvicPrioBits>
        <vendorSystickConfig>false</vendorSystickConfig>
        <deviceNumInterrupts>96</deviceNumInterrupts>
    </cpu>
    <headerSystemFilename>system_RA4</headerSystemFilename>
    <headerDefinitionsPrefix>R_</headerDefinitionsPrefix>
    <addressUnitBits>8</addressUnitBits>
    <width>32</width>
    <size>32</size>
    <access>read-write</access>
    <resetValue>0</resetValue>
    <resetMask>0xffffffff</resetMask>
    <peripherals>
        <peripheral>
            <name>RMPU</name>
            <description>Renesas Memory Protection Unit</description>
            <baseAddress>0x40000000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x04</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x100</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x104</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x108</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x10C</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x200</offset>
                <size>136</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>MMPUOAD</name>
                    <description>MMPU Operation After Detection Register</description>
                    <addressOffset>0x0000</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>OAD</name>
                            <description>Operation after detection</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>KEY</name>
                            <description>This bit enables or disables writes to the OAD bit.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MMPUOADPT</name>
                    <description>MMPU Operation After Detection Protect Register</description>
                    <addressOffset>0x0004</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>PROTECT</name>
                            <description>Protection of register</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>KEY</name>
                            <description>Key code</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MMPUENDMAC</name>
                    <description>MMPU Enable Register for DMAC</description>
                    <addressOffset>0x0100</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>ENABLE</name>
                            <description>Bus Master MPU of DMAC enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>KEY</name>
                            <description>These bits enable or disable writes to the ENABLE bit.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MMPUENPTDMAC</name>
                    <description>MMPU Enable Protect Register for DMAC</description>
                    <addressOffset>0x0104</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>PROTECT</name>
                            <description>Protection of register</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>KEY</name>
                            <description>These bits enable or disable writes to the PROTECT bit.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MMPURPTDMAC</name>
                    <description>MMPU Regions Protect Register for DMAC</description>
                    <addressOffset>0x0108</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>PROTECT</name>
                            <description>Protection of register</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>KEY</name>
                            <description>These bits enable or disable writes to the PROTECT bit.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MMPURPTDMAC_SEC</name>
                    <description>MMPU Regions Protect register for DMAC Secure</description>
                    <addressOffset>0x010C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>PROTECT</name>
                            <description>Protection of register</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>KEY</name>
                            <description>These bits enable or disable writes to the PROTECT bit.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>MMPUACDMAC%s</name>
                    <description>MMPU Access Control Register for DMAC</description>
                    <addressOffset>0x0200</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>ENABLE</name>
                            <description>Region enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RP</name>
                            <description>Read protection</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>WP</name>
                            <description>Write protection</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>MMPUSDMAC%s</name>
                    <description>MMPU Start Address Register for DMAC</description>
                    <addressOffset>0x0204</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000001f</resetMask>
                    <fields>
                        <field>
                            <name>MMPUS</name>
                            <description>Region start address register</description>
                            <lsb>5</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>MMPUEDMAC%s</name>
                    <description>MMPU End Address Register for DMAC</description>
                    <addressOffset>0x0208</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0000001f</resetValue>
                    <resetMask>0x0000001f</resetMask>
                    <fields>
                        <field>
                            <name>MMPUE</name>
                            <description>Region end address register</description>
                            <lsb>5</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
