amcelroy/ra-pac/svd_patch/R7FA4M3AF.svd
                <register>
                    <name>ICUSARH</name>
                    <description>Interrupt Controller Unit Security Attribution Register H</description>
                    <addressOffset>0x74</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xffffffff</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SAIELSR32</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR33</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR34</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR35</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR36</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR37</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR38</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR39</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR40</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR41</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR42</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR43</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR44</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR45</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR46</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR47</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR48</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR49</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR50</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR51</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR52</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR53</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR54</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR55</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR56</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR57</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>25</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR58</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>26</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR59</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>27</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR60</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR61</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR62</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAIELSR63</name>
                            <description>Security attributes of registers for IELSR63 to IELSR32</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
