amcelroy/ra-pac/svd_patch/R7FA4M3AF.svd
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>RMINCP%s</name>
                    <description>Minute Capture Register %s</description>
                    <alternateRegister>BCNT1CP%s</alternateRegister>
                    <addressOffset>0x54</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>MIN1</name>
                            <description>1-Minute Capture</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MIN10</name>
                            <description>10-Minute Capture</description>
                            <lsb>4</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>BCNT2CP%s</name>
                    <description>BCNT2 Capture Register %s</description>
                    <addressOffset>0x56</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>RHRCP%s</name>
                    <description>Hour Capture Register %s</description>
                    <alternateRegister>BCNT2CP%s</alternateRegister>
                    <addressOffset>0x56</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>HR1</name>
                            <description>1-Hour Capture</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HR10</name>
                            <description>10-Hour Capture</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PM</name>
                            <description>PM</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>BCNT3CP%s</name>
                    <description>BCNT3 Capture Register %s</description>
                    <addressOffset>0x5A</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>RDAYCP%s</name>
                    <description>Date Capture Register %s</description>
                    <alternateRegister>BCNT3CP%s</alternateRegister>
                    <addressOffset>0x5A</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>DATE1</name>
                            <description>1-Day Capture</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DATE10</name>
                            <description>10-Day Capture</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>RMONCP%s</name>
                    <description>Month Capture Register %s</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xe0</resetMask>
                    <fields>
                        <field>
                            <name>MON1</name>
                            <description>1-Month Capture</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MON10</name>
                            <description>10-Month Capture</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
