amcelroy/ra-pac/svd_patch/R7FA4M3AF.svd
                <register>
                    <name>PHYSECTRL</name>
                    <description>PHY Single,ended Receiver Control Register</description>
                    <addressOffset>0x0F4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CNEN</name>
                            <description>Single,ended Receiver Enable</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPUSR0R</name>
                    <description>Deep Software Standby USB Transceiver Control/Pin Monitor Register</description>
                    <addressOffset>0x400</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff4cffff</resetMask>
                    <fields>
                        <field>
                            <name>SRPC0</name>
                            <description>USB Single,ended Receiver Control</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RPUE0</name>
                            <description>DP Pull,Up Resistor Control</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DRPD0</name>
                            <description>D+/D- Pull,Down Resistor Control</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FIXPHY0</name>
                            <description>USB Transceiver Output Fix</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DP0</name>
                            <description>USB D+ Input</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DM0</name>
                            <description>USB D- Input</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DOVCA0</name>
                            <description>USB OVRCURA Input</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DOVCB0</name>
                            <description>USB OVRCURB Input</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DVBSTS0</name>
                            <description>USB VBUS Input</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPUSR1R</name>
                    <description>Deep Software Standby USB Suspend/Resume Interrupt Register</description>
                    <addressOffset>0x404</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>DPINTE0</name>
                            <description>USB DP Interrupt Enable/Clear</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DMINTE0</name>
                            <description>USB DM Interrupt Enable/Clear</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DOVRCRAE0</name>
                            <description>USB OVRCURA Interrupt Enable/Clear</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DOVRCRBE0</name>
                            <description>USB OVRCURB Interrupt Enable/Clear</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DVBSE0</name>
                            <description>USB VBUS Interrupt Enable/Clear</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DPINT0</name>
                            <description>USB DP Interrupt Source Recovery</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DMINT0</name>
                            <description>USB DM Interrupt Source Recovery</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DOVRCRA0</name>
                            <description>USB OVRCURA Interrupt Source Recovery</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DOVRCRB0</name>
                            <description>USB OVRCURB Interrupt Source Recovery</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DVBINT0</name>
                            <description>USB VBUS Interrupt Source Recovery</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
