amcelroy/ra-pac/svd_patch/R7FA4M3AF.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>IIC0WU</name>
            <description>Inter,Integrated Circuit 0 Wake,up Unit</description>
            <baseAddress>0x4009F014</baseAddress>
            <addressBlock>
                <offset>0x02</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>ICWUR</name>
                    <description>I2C Bus Wakeup Unit Register</description>
                    <addressOffset>0x02</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x10</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>WUAFA</name>
                            <description>Wakeup Analog Filter Additional Selection</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>WUACK</name>
                            <description>ACK Bit for Wakeup Mode</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WUF</name>
                            <description>Wakeup Event Occurrence Flag</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>WUIE</name>
                            <description>Wakeup Interrupt Request Enable</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>WUE</name>
                            <description>Wakeup Function Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICWUR2</name>
                    <description>I2C Bus Wakeup Unit Register 2</description>
                    <addressOffset>0x03</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xfd</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>WUSEN</name>
                            <description>Wakeup Function Synchronous Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>WUASYF</name>
                            <description>Wakeup Function Asynchronous Operation Status Flag</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>WUSYF</name>
                            <description>Wakeup Function Synchronous Operation Status Flag</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="IIC0">
            <name>IIC1</name>
            <description>Inter,Integrated Circuit 1</description>
            <baseAddress>0x4009F100</baseAddress>
        </peripheral>
        <peripheral>
            <name>CAN0</name>
            <description>Controller Area Network 0</description>
            <baseAddress>0x400A8000</baseAddress>
            <addressBlock>
                <offset>0x200</offset>
                <size>560</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x820</offset>
                <size>57</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_ID</name>
                    <description>Mailbox ID Register %s</description>
                    <addressOffset>0x200</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000001</resetMask>
                    <fields>
                        <field>
                            <name>EID</name>
                            <description>Extended ID of data and remote frames</description>
                            <lsb>0</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SID</name>
                            <description>Standard ID of data and remote frames</description>
                            <lsb>18</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTR</name>
                            <description>Remote Transmission Request</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>IDE</name>
                            <description>ID Extension</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_DL</name>
                    <description>Mailbox Data Length Register %s</description>
                    <addressOffset>0x204</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x0000</resetMask>
                    <fields>
                        <field>
                            <name>DLC</name>
                            <description>Data Length Code</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_D0</name>
                    <description>Mailbox Data Register %s</description>
                    <addressOffset>0x206</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>DATA0</name>
                            <description>Data Bytes 0</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_D1</name>
                    <description>Mailbox Data Register %s</description>
                    <addressOffset>0x207</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>DATA1</name>
                            <description>Data Bytes 1</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_D2</name>
                    <description>Mailbox Data Register %s</description>
                    <addressOffset>0x208</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>DATA2</name>
                            <description>Data Bytes 2</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_D3</name>
                    <description>Mailbox Data Register %s</description>
                    <addressOffset>0x209</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>DATA3</name>
                            <description>Data Bytes 3</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_D4</name>
                    <description>Mailbox Data Register %s</description>
                    <addressOffset>0x20A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>DATA4</name>
                            <description>Data Bytes 4</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_D5</name>
                    <description>Mailbox Data Register %s</description>
                    <addressOffset>0x20B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>DATA5</name>
                            <description>Data Bytes 5</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_D6</name>
                    <description>Mailbox Data Register %s</description>
                    <addressOffset>0x20C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>DATA6</name>
                            <description>Data Bytes 6</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_D7</name>
                    <description>Mailbox Data Register %s</description>
                    <addressOffset>0x20D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>DATA7</name>
                            <description>Data Bytes 7</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_TS</name>
                    <description>Mailbox Time Stamp Register %s</description>
                    <addressOffset>0x20E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x0000</resetMask>
                    <fields>
                        <field>
                            <name>TSL</name>
                            <description>Time Stamp Lower Byte</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSH</name>
                            <description>Time Stamp Higher Byte</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x04</dimIncrement>
                    <name>MKR[%s]</name>
                    <description>Mask Register %s</description>
                    <addressOffset>0x400</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>EID</name>
                            <description>Extended ID</description>
                            <lsb>0</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SID</name>
                            <description>Standard ID</description>
                            <lsb>18</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x04</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>FIDCR%s</name>
                    <description>FIFO Received ID Compare Register %s</description>
                    <addressOffset>0x420</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>EID</name>
                            <description>Extended ID of data and remote frames</description>
                            <lsb>0</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SID</name>
                            <description>Standard ID of data and remote frames</description>
                            <lsb>18</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTR</name>
                            <description>Remote Transmission Request</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>IDE</name>
                            <description>ID Extension</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
