amcelroy/ra-pac/svd_patch/R7FA4M3AF.svd
                <register>
                    <name>MSSAR</name>
                    <description>Module Stop Security Attribution Register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xffffffff</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>MSSAR0</name>
                            <description>The MSTPCRC.MSTPC14 bit security attribution</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSSAR1</name>
                            <description>The MSTPCRA.MSTPA22 bit security attribution</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSSAR2</name>
                            <description>The MSTPCRA.MSTPA7 bit security attribution</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSSAR3</name>
                            <description>The MSTPCRA.MSTPA0 bit security attribution</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFSAMONA</name>
                    <description>Code Flash Security Attribution Monitor Register A</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff007fff</resetMask>
                    <fields>
                        <field>
                            <name>CFS2</name>
                            <description>Code Flash Secure area 2</description>
                            <lsb>15</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFSAMONB</name>
                    <description>Code Flash Security Attribution Monitor Register B</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff0003ff</resetMask>
                    <fields>
                        <field>
                            <name>CFS1</name>
                            <description>Code Flash Secure area 1</description>
                            <lsb>10</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DFSAMON</name>
                    <description>Data Flash Security Attribution Monitor Register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffff03ff</resetMask>
                    <fields>
                        <field>
                            <name>DFS</name>
                            <description>Data flash Secure area</description>
                            <lsb>10</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSAMONA</name>
                    <description>SRAM Security Attribution Monitor Register A</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffe01fff</resetMask>
                    <fields>
                        <field>
                            <name>SS2</name>
                            <description>SRAM Secure area 2</description>
                            <lsb>13</lsb>
                            <msb>20</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSAMONB</name>
                    <description>SRAM Security Attribution Monitor Register B</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffe003ff</resetMask>
                    <fields>
                        <field>
                            <name>SS1</name>
                            <description>SRAM secure area 1</description>
                            <lsb>10</lsb>
                            <msb>20</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DLMMON</name>
                    <description>Device Lifecycle Management State Monitor Register</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xfffffff0</resetMask>
                    <fields>
                        <field>
                            <name>DLMMON</name>
                            <description>Device Lifecycle Management State Monitor</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
